In [1]:
import pandas as pd

data = [[1, 1], [2, 1], [3, 1], [4, 2], [5, 1], [6, 2], [7, 2]]
logs = pd.DataFrame(data, columns=['id', 'num']).astype({'id':'Int64', 'num':'Int64'})

logs

   id  num
0   1    1
1   2    1
2   3    1
3   4    2
4   5    1
5   6    2
6   7    2

## 方法一：创建两个新列

首先在 DataFrame 中创建两个新列 ‘prev1_num’ 和 ‘prev2_num’，它们分别是 ‘num’ 列向下移动一位和两位的结果。然后，我们找出 ‘num’ 列、‘prev1_num’ 列和 ‘prev2_num’ 列都相等的行，这些行就是 ‘num’ 值连续出现至少三次的行。

In [2]:
logs['prev1_num'] = logs['num'].shift(1)
logs

   id  num  prev1_num
0   1    1       <NA>
1   2    1          1
2   3    1          1
3   4    2          1
4   5    1          2
5   6    2          1
6   7    2          2

In [3]:
logs['prev2_num'] = logs['num'].shift(2)
logs

   id  num  prev1_num  prev2_num
0   1    1       <NA>       <NA>
1   2    1          1       <NA>
2   3    1          1          1
3   4    2          1          1
4   5    1          2          1
5   6    2          1          2
6   7    2          2          1

In [4]:
# 找出 'num' 列、'prev1_num' 列和 'prev2_num' 列都相等的行
result = logs[(logs['num'] == logs['prev1_num']) & (logs['num'] == logs['prev2_num'])]
result

   id  num  prev1_num  prev2_num
2   3    1          1          1

In [5]:
result.rename(columns={'num':'ConsecutiveNums'})[['ConsecutiveNums']].drop_duplicates()

   ConsecutiveNums
2                1

## 方法二：for 循环（更快）

In [6]:
ConsecutiveNums = []
cnt = 0
old_num = None
for num in logs.num:
    if num == old_num:
        cnt += 1
    else:
        cnt = 1
        old_num = num
    if cnt == 3:
        if num not in ConsecutiveNums:
            ConsecutiveNums.append(num)

pd.DataFrame({'ConsecutiveNums':ConsecutiveNums})

   ConsecutiveNums
0                1